{
  "heros": [
    {
      "slug": "superman",
      "name": "Superman",
      "alias": "Clark Kent (Kal-El)",
      "image": "superman_face.jpg",
      "abilities": "super strength, flight, invulnerability, super speed, heat vision, freeze breath, x-ray vision, superhuman hearing, healing factor",
      "history": "Superman was born on the fictional planet Krypton with the birth name of Kal-El. As a baby, his parents sent him to Earth in a small spaceship shortly before Krypton was destroyed. His ship landed in the town of Smallville, Kansas. He was found and adopted by farmers Jonathan and Martha Kent, who named him Clark Kent. Clark began developing superhuman abilities. His adoptive parents advised him to use his powers to help humanity, and he decided to fight crime as a vigilante. To protect his personal life, he uses the alias \"Superman\" when fighting crime. Clark resides in the city of Metropolis, where he works as a journalist for the Daily Planet. Superman's love interest-later wife and fellow journalist is Lois Lane. His archenemy is Lex Luthor. Other enemies include Brainiac, General Zod, and Darkseid."
    },
    {
      "slug": "batman",
      "name": "Batman",
      "alias": "Bruce Wayne",
      "image": "batman_face.jpg",
      "abilities": "exceptional martial artist, combat strategy, inexhaustible wealth, brilliant deductive skill, advanced technology",
      "history": "Bruce Wayne is a wealthy American playboy, philanthropist, and industrialist who resides in Gotham City. He swears vengeance against criminals after witnessing the murder of his parents Thomas and Martha as a child. He trains himself physically and intellectually, crafts a bat-inspired persona, and monitors the Gotham streets at night. He has sidekicks such as Robin and Batgirl and helpers such as Alfred Pennyworth, James Gordon, and Catwoman. His archenemy is the Joker and other enemies such as the Penguin, the Riddler, and Two-Face."
    },
    {
      "slug": "wonder-woman",
      "name": "Wonder Woman",
      "alias": "Diana Prince",
      "image": "wonderwoman_face.jpg",
      "abilities": "super strength, invulnerability, flight, combat skill, combat strategy, superhuman agility, healing factor, magic weaponry",
      "history": "Diana is from the island nation of Themyscira. Her official title is Princess Diana of Themyscira. When blending into the society outside of her homeland, she sometimes adopts her civilian identity, Diana Prince. She is the biological daughter of Zeus and Hippolyta, jointly raised by her mother and her aunts Antiope and Menalippe. Her enemies bent on destroying her include Cheetah, Ares, Circe, Doctor Poison, Giganta, Blue Snowman, and Doctor Cyber. She is also a part of the superhero teams Justice Society and Justice League."
    },
    {
      "slug": "aquaman",
      "name": "Aquaman",
      "alias": "Arthur Curry",
      "image": "aquaman_face.jpg",
      "abilities": "super strength, durability, control over sea life, exceptional swimming ability, ability to breathe underwater",
      "history": "The son of lighthouse keeper Tom Curry and Atlanna, a water-breathing outcast from the lost underwater city of Atlantis, Aquaman is the alias of Arthur Curry. Due to his heritage, Aquaman discovered as a youth that he possessed various superhuman abilities, including the powers of surviving underwater, communication with sea life and tremendous swimming prowess. Eventually, Arthur decided to use his talents to become the defender of the Earth's oceans. His mentor is Vulko and his powerful wife is Mera. His villains include his archenemy Black Manta and his own half-brother Ocean Master."
    },
    {
      "slug": "the-flash",
      "name": "The Flash",
      "alias": "Barry Allen",
      "image": "theflash_face.jpg",
      "abilities": "super speed, intangibility, superhuman agility, time travel, creates and controls lightning, multiversal knowledge",
      "history": "Barry Allen is an assistant scientist from the Criminal and Forensic Science Division of Central City Police Department. Barry had a reputation for being very slow, deliberate, and frequently late, which frustrated his fiancé, Iris West. One night, as he was preparing to leave work, a freak lightning bolt struck a nearby shelf in his lab and doused him with a cocktail of unnamed chemicals. As a result, Barry found that he could run extremely fast and had matching reflexes. He became a crimefighter active in Central City."
    },
    {
      "slug": "cyborg",
      "name": "Cyborg",
      "alias": "Victor Stone",
      "image": "cyborg_face.jpg",
      "abilities": "super strength, advanced technology, instant weaponry, genius-level intellect, control over technology, computer hacking, durability, teleportation",
      "history": "Saved by his scientist father after an accident left very little of Victor’s body intact, Dr. Silas Stone used all of his advanced scientific knowledge to save his only child’s life. Although he always exhibited a genius-level intellect, young Victor Stone didn’t want a life dedicated to science and research like his parents. Instead, Vic dreamed of being a football player and devoted all of his time to becoming a star athlete while he was still in high school. But a tragic twist of fate that should have left him dead instead found him becoming part man and part machine. He always carried a sadness within him. Vic Stone is a member of the Teen Titans and also becomes a member of the Justice League."
    },
    {
      "slug": "starfire",
      "name": "Starfire",
      "alias": "Kori Anders (Koriand’r)",
      "image": "starfire_face.jpg",
      "abilities": "High Intelligence Superhuman Strength, Durability, Speed, Accelerating Healing Factor, Ultraviolet Energy Projection, Starbolts, Flight",
      "history": "Koriand'r was born on Tamaran to King Myand'r and Queen Luand'r, and is the younger sister to Komand'r and the older sister to her brother Ryand'r. She is a Tamaranean princess who fled to Earth after enduring torture from the alien conquerors, the Citadel. On Earth, she befriended Robin and his allies, thus joining them in the formation of the Teen Titans. She is one of the main love-interests of Dick Grayson, AKA Nightwing (as well as the first Robin)."
    },
    {
      "slug": "green-arrow",
      "name": "The Green Arrow",
      "alias": "Oliver Queen",
      "image": "greenarrow_face.jpg",
      "abilities": "archery, unrivaled aim, exceptional martial artist, inexhaustible wealth",
      "history": "Oliver Jonas Queen is a wealthy businessman, owner of Queen Industries, and a well-known celebrity in Star City. After accidentally falling off of his cruise ship he had been stranded on Starfish Island. He learned to survive by any means necessary. He developed primitive Trick Arrows as advanced methods of hunting and foraging for food. He helped a small boat crew fight off Pirates with the skills he learned. Now calling himself Green Arrow, he realized that he could use his abilities to serve society for the greater good and fight crime."
    },
    {
      "slug": "beastboy",
      "name": "Beast Boy",
      "alias": "Garfield Logan",
      "image": "beastboy_face.jpg",
      "abilities": "capable of transforming into any animal, connection to all animal life",
      "history": "As a child, Garfield Logan contracted a rare illness called Sakutia and was cured by a serum from a green monkey. This serum had the unintended effect of turning his skin and hair green and gave him the ability to change into any animal form. Later, he became a member of the New Teen Titans. During his tenure on the team, he had a brief but disastrous relationship with Terra and developed a long-lasting enmity for team enemy Deathstroke."
    },
    {
      "slug": "raven",
      "name": "Raven",
      "alias": "Rachel Roth",
      "image": "raven_face.jpg",
      "abilities": "darkness manipulation, flight, Astral projection, teleportation, magic, pyrokinesis",
      "history": "Raven was born the half-breed daughter of a human mother named Angela Roth and the demon overlord Emperor Trigon. She was conceived when her mother ran away from home and joined a cult, which then summoned the demon lord Trigon. Angela Roth, going by Arella, retreated to an alternate dimension where Raven was born and raised in the pacifistic reality called Azarath. Growing up, Raven was taught to control her emotions by the Azar and the Azarathian monks in order to suppress and control her inherited demonic powers. Eventually, she learned that Trigon was planning to come to her dimension and vowed to stop him. She initially approached the Justice League, but they refused her on the advice of Zatanna who sensed her demonic parentage. In desperation, she reformed the Titans as the New Teen Titans to fight her father."
    },
    {
      "slug": "nightwing",
      "name": "Nightwing",
      "alias": "Richard “Dick” Grayson",
      "image": "nightwing_face.jpg",
      "abilities": "exceptional martial artist, brilliant deductive skills, gymnastic ability, peak agility, combat skill, customized weapons",
      "history": "When his circus acrobat family was brutally murdered, Dick Grayson was taken in by billionaire and bat-friendly superhero Bruce Wayne. Bruce shared his secret life as Batman with the young boy and eventually molded him into Robin. As Dick grew older, playing second fiddle to the sternest hero in the Justice League began to wear on him, he struck out on his own. He stays true to what he learned as Robin while coming into his own as a respected member of the superhero pantheon. He was a part of the Teen Titans as Robin where his love interest was Starfire."
    }
  ],
  "villians": [
    {
      "slug": "joker",
      "name": "The Joker",
      "alias": "NA",
      "image": "joker_face.jpg",
      "abilities": "complete unpredictability, chaos agent, customized weapons, wields toxin which causes victims to die laughing",
      "history": "A homicidal artist and an agent of chaos, the Clown Prince of Crime is everything Batman fights against. No name strikes terror into the hearts of Gotham’s citizens quite like the Joker. In a city overrun with larger-than-life criminals, the always-laughing villain stands alone. He is a complete psychopath with no moral compass whatsoever. His real name and identity remain completely unknown but he is characterized by his chalk-white skin, green hair, and a permanent grin stretched across his face. He only finds humor in the suffering of others. He has brought so much pain to Batman and as long as Batman brings justice to Gotham City, Joker will bring nightmares."
    },
    {
      "slug": "harley-quinn",
      "name": "Harley Quinn",
      "alias": "Harleen Quinzel",
      "image": "harleyquinn_face.jpg",
      "abilities": "complete unpredictability, superhuman agility, skilled fighter, intelligence, emotional manipulation, immunity to toxins",
      "history": "Quinn is a former psychologist at Gotham City's Arkham Asylum who was manipulated by and fell in love with the Joker, her patient. The sidekick and lover of the Joker as well as the criminal associate and best friend of Poison Ivy. Later stories depicted Quinn as an independent supervillain who has left her abusive and codependent relationship with the Joker behind."
    },
    {
      "slug": "lex-luthor",
      "name": "Lex Luthor",
      "alias": "Lex Luthor",
      "image": "lexluthor_face.jpg",
      "abilities": "genius-level intellect, inexhaustible wealth, political influence",
      "history": "Lex believes he is entitled to both popularity and power. He wants the adoration of others and control over either Smallville or Metropolis. His goal eventually rises to control over Earth and possibly universal domination. Luthor's other defining trait is his obsession to destroy Superman and humiliate the alien hero, either by displaying his own superiority by achieving victory without superpowers or by proving the Man of Steel is motivated by selfish desire rather than heroism"
    },
    {
      "slug": "cheetah",
      "name": "Cheetah",
      "alias": "Barbara Ann Minerva",
      "image": "cheetah_face.jpg",
      "abilities": "super strength, superhuman agility, skilled fighter, razor-sharp teeth and claws, severe bloodlust",
      "history": "Archaeologist Barbara Ann Minerva always had a reputation for going to any lengths to retrieve the artifacts. Her attitude, unsurprisingly, resulted in tragedy. After growing increasingly obsessed with mythology and divinity, Barbara took her team deep into the wilds of Africa, only to be trapped and forced to participate in an ancient, arcane ritual that cursed and transformed her into a human-cheetah hybrid with blood lust."
    },
    {
      "slug": "catwoman",
      "name": "Catwoman",
      "alias": "Selina Kyle",
      "image": "catwoman_face.jpg",
      "abilities": "exceptional martial artist, gymnastic ability, combat skill, master thief and cat burglar, customized weapons",
      "history": "Selina was raised alongside her sister Maggie by a drunken father who habitually mistreated her mother. they later committed suicide when Selina was young. During her childhood, she stole costumes and a gun, which she used to threaten a bunch of bullies who were threatening a boy. She later became a Gotham City expert thief who crossed paths with Batman on many occasions. Having largely left behind her villainous ways, she now operates as a frequent ally of the Batman Family."
    },
    {
      "slug": "black-manta",
      "name": "Black Manta",
      "alias": "David Hyde",
      "image": "blackmanta_face.jpg",
      "abilities": "enhanced strength, energy blasts, skilled fighter, unrivaled swimmer, master swordsman, advanced technology, intelligence",
      "history": "David Hyde is a descendant of the lost tribe of Atlanteans known as the Deserters. His mother Ramona walked out on the family when he was a child and he was raised by his father Jesse on the family fishing boat, the Black Manta. After an altercation that ended with both, Author and David's fathers dying, David has wanted revenge ever since. He has been on many supervillains teams such as the Legion of Doom the Injustice League and the Secret Society of Super-Villains."
    },
    {
      "slug": "poison-ivy",
      "name": "Poison Ivy",
      "alias": "Dr. Pamela Lillian Isley",
      "image": "poisonivy_face.jpg",
      "abilities": "control over plant life, intelligence, immunity to toxins, pheromone usage, secretes deadly toxins",
      "history": "Dr. Pamela Isley, was born with a skin condition where she couldn’t be in the sunlight. Her father was very abusive to her and her mother growing up. She later became an eco-terrorist with the power to control all plant life. Having been turned into a plant/human hybrid from an experiment gone wrong. She struggles with her humanity and her insanity to protect plants at all costs. Because of this, she has often acted as an adversary of Batman in Gotham City."
    },
    {
      "slug": "deathstroke",
      "name": "Deathstroke",
      "alias": "Slade Wilson",
      "image": "deathstroke_face.jpg",
      "abilities": "exceptional martial artist, combat strategy, durability, enhanced strength and speed, weapons expert, superhuman agility, master swordsman",
      "history": "Salde is the world's best and most expensive mercenary. When he was 16 he lied about his age and joined the army. He met his wife Adeline Kane who trained him to be the best fighter. Wilson volunteered for a medical experiment designed to stimulate his adrenal gland in the hopes of increasing a soldier's ability. The experiment did not go as expected, and Slade fell into a coma. When he awakened, he discovered that he was now capable of using 90% of his brain capacity, and his strength, durability, and agility were increased to near-superhuman levels. After mercenaries kill one of his sons, leading to his wife leaving him, he starts to use his abilities as a mercenary himself. He is a known enemy of The Teen Titans and Beast Boy."
    },
    {
      "slug": "captain-boomerang",
      "name": "Captain Boomerang",
      "alias": "Digger Harkness",
      "image": "captainboomerang_face.jpg",
      "abilities": "boomerang throwing, unrivaled aim, combat skill, complete unpredictability",
      "history": "A master of boomerangs and boomerang-based fighting, Digger Harkness began his career promoting toy boomerangs. After he immigrated from Australia to the United States, his life turned into villainy when he decided to use his skills to steal jewels. He developed a line of weaponized boomerangs, terrorizing Central City. He was one of The Flash’s enemies. Instead of serving out his entire sentence in prison, he was offered a position on the Suicide Squad."
    }
  ],
  "teams": [
    {
      "slug": "justice-league",
      "name": "The Justice League",
      "image": "justiceleague_team.jpg",
      "teammates": "Superman, Batman, Wonderwoman, Green Arrow, Aquaman, The Flash",
      "appearance": "The Brave and The Bold #28 (1960)",
      "history": "The Justice League is an organization comprised of the world's greatest superheroes. Together, they operate as a team dedicated to fighting crime and injustice and act as Earth's first line of defense from terrestrial, extra-terrestrial, and inter-dimensional threats."
    },
    {
      "slug": "suicide-squad",
      "name": "The Suicide Squad",
      "image": "suicidesquad_team.jpg",
      "teammates": "Captain Boomerang, Harley Quinn, Deathstroke,",
      "appearance": "The Brave and The Bold #25 (1959)",
      "history": "The Suicide Squad, is a covert paramilitary team comprised of incarcerated supervillains, orchestrated by Amanda Waller out of Belle Reve Penitentiary. It was established with the task of putting incarcerated supervillains into United States Government service in exchange for a reduction in their prison sentences."
    },
    {
      "slug": "teen-titans",
      "name": "The Teen Titans",
      "image": "teentitans_team.jpg",
      "teammates": "Nightwing, Starfire, Cyborg, Raven, Beastboy",
      "appearance": "The Brave and The Bold #54 (1964)",
      "history": "The Teen Titans are an organization of young vigilantes banded together to fight crime. They began as a group of sidekicks looking to distinguish themselves from their mentors, they would go on to expand into a worldwide establishment."
    },
    {
      "slug": "injustice-league",
      "name": "Injustice League of America",
      "image": "injusticeleague_team.jpg",
      "teammates": "The Joker, Lex Luther, Catwoman, Black Manta, Cheetah",
      "appearance": "Justice League International #23 (1989)",
      "history": "The Injustice League was a group of supervillains that formed to oppose the anarchic rule of the Crime Syndicate during their interdimensional invasion."
    }
  ]
}
